### Terraform Plan

<details>
<summary>Click to see the plan</summary>

```
[command]/home/runner/work/_temp/5281de3f-a904-49c3-93c2-5ff299d0d159/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs_service.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.ecs_service.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:654654485498:service/hello-world-api-cluster/hello-world-api-service"
        name                               = "hello-world-api-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api:3" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "654654485498.dkr.ecr.us-east-1.amazonaws.com/hello-world-api:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/hello-world-api"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "hello-world-api"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "hello-world-api" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.load_balancer.aws_route53_record.alb will be created
  + resource "aws_route53_record" "alb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "lucasherculano.xyz"
      + type            = "A"
      + zone_id         = "Z04073202OY1O6A1PI872"

      + alias {
          + evaluate_target_health = true
          + name                   = "hello-world-api-alb-820948696.us-east-1.elb.amazonaws.com"
          + zone_id                = "Z35SXDOTRQ7X7K"
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs_service.data.aws_region.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_region" "current" {%0A      + description = (known after apply)%0A      + endpoint    = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A    }%0A%0A  # module.ecs_service.aws_ecs_service.main will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A        id                                 = "arn:aws:ecs:us-east-1:654654485498:service/hello-world-api-cluster/hello-world-api-service"%0A        name                               = "hello-world-api-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api:3" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs_service.aws_ecs_task_definition.main must be replaced%0A-/+ resource "aws_ecs_task_definition" "main" {%0A      ~ arn                      = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api:3" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A            [%0A              - {%0A                  - cpu              = 0%0A                  - environment      = []%0A                  - essential        = true%0A                  - image            = "654654485498.dkr.ecr.us-east-1.amazonaws.com/hello-world-api:latest"%0A                  - logConfiguration = {%0A                      - logDriver = "awslogs"%0A                      - options   = {%0A                          - awslogs-group         = "/ecs/hello-world-api"%0A                          - awslogs-region        = "us-east-1"%0A                          - awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  - mountPoints      = []%0A                  - name             = "hello-world-api"%0A                  - portMappings     = [%0A                      - {%0A                          - containerPort = 3000%0A                          - hostPort      = 3000%0A                          - protocol      = "tcp"%0A                        },%0A                    ]%0A                  - systemControls   = []%0A                  - volumesFrom      = []%0A                },%0A            ]%0A        ) -> (known after apply) # forces replacement%0A      ~ id                       = "hello-world-api" -> (known after apply)%0A      ~ revision                 = 3 -> (known after apply)%0A      - tags                     = {} -> null%0A      ~ tags_all                 = {} -> (known after apply)%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.load_balancer.aws_route53_record.alb will be created%0A  + resource "aws_route53_record" "alb" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "lucasherculano.xyz"%0A      + type            = "A"%0A      + zone_id         = "Z04073202OY1O6A1PI872"%0A%0A      + alias {%0A          + evaluate_target_health = true%0A          + name                   = "hello-world-api-alb-820948696.us-east-1.elb.amazonaws.com"%0A          + zone_id                = "Z35SXDOTRQ7X7K"%0A        }%0A    }%0A%0APlan: 2 to add, 1 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```
</details>